Revit 2027 API
Connector.Utility Property
 Indicates if the connector is a utility connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Utility { get; }
Public ReadOnly Property Utility As Boolean
	Get
public:
property bool Utility {
	bool get ();
}
member Utility : bool with get
Property Value
Boolean
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace